; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=61, out_folder=htg/blocksworld/training, instance_id=41, seed=2065, goal_proportion=0.1

(define (problem blocksworld-41)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 - object)
 (:init 
    (arm-empty)
    (clear b61)
    (on b61 b60)
    (on b60 b16)
    (on b16 b8)
    (on b8 b32)
    (on b32 b37)
    (on b37 b26)
    (on b26 b55)
    (on b55 b30)
    (on b30 b9)
    (on b9 b18)
    (on b18 b1)
    (on b1 b7)
    (on b7 b27)
    (on b27 b35)
    (on b35 b44)
    (on-table b44)
    (clear b50)
    (on b50 b51)
    (on b51 b56)
    (on b56 b59)
    (on b59 b54)
    (on b54 b4)
    (on b4 b24)
    (on b24 b20)
    (on b20 b49)
    (on b49 b46)
    (on b46 b28)
    (on b28 b38)
    (on b38 b43)
    (on b43 b31)
    (on b31 b22)
    (on b22 b2)
    (on-table b2)
    (clear b47)
    (on b47 b57)
    (on b57 b5)
    (on b5 b13)
    (on b13 b21)
    (on-table b21)
    (clear b10)
    (on b10 b52)
    (on b52 b36)
    (on b36 b34)
    (on b34 b29)
    (on-table b29)
    (clear b53)
    (on b53 b33)
    (on b33 b48)
    (on b48 b23)
    (on b23 b42)
    (on b42 b39)
    (on b39 b19)
    (on-table b19)
    (clear b11)
    (on b11 b25)
    (on b25 b3)
    (on b3 b15)
    (on-table b15)
    (clear b58)
    (on b58 b12)
    (on b12 b45)
    (on b45 b14)
    (on b14 b6)
    (on b6 b17)
    (on b17 b40)
    (on b40 b41)
    (on-table b41))
 (:goal  (and 
    (clear b6)
    (on b6 b3)
    (on b3 b1)
    (on b1 b2)
    (on b2 b4)
    (on b4 b5)
    (on-table b5))))

; plan
1. (unstack b47 b57)
   deleted: (on b47 b57) (clear b47) (arm-empty)
   added: (holding b47) (clear b57)
   goals met: 0 of 7
2. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 0 of 7
3. (unstack b57 b5)
   deleted: (on b57 b5) (clear b57) (arm-empty)
   added: (holding b57) (clear b5)
   goals met: 0 of 7
4. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 0 of 7
5. (unstack b5 b13)
   deleted: (on b5 b13) (clear b5) (arm-empty)
   added: (holding b5) (clear b13)
   goals met: 0 of 7
6. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 7
7. (unstack b58 b12)
   deleted: (on b58 b12) (clear b58) (arm-empty)
   added: (holding b58) (clear b12)
   goals met: 1 of 7
8. (putdown b58)
   deleted: (holding b58)
   added: (clear b58) (arm-empty) (on-table b58)
   goals met: 1 of 7
9. (unstack b12 b45)
   deleted: (on b12 b45) (clear b12) (arm-empty)
   added: (holding b12) (clear b45)
   goals met: 1 of 7
10. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 1 of 7
11. (unstack b45 b14)
   deleted: (on b45 b14) (clear b45) (arm-empty)
   added: (holding b45) (clear b14)
   goals met: 1 of 7
12. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 1 of 7
13. (unstack b14 b6)
   deleted: (on b14 b6) (clear b14) (arm-empty)
   added: (holding b14) (clear b6)
   goals met: 2 of 7
14. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 2 of 7
15. (unstack b11 b25)
   deleted: (on b11 b25) (clear b11) (arm-empty)
   added: (holding b11) (clear b25)
   goals met: 2 of 7
16. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 2 of 7
17. (unstack b25 b3)
   deleted: (on b25 b3) (clear b25) (arm-empty)
   added: (holding b25) (clear b3)
   goals met: 2 of 7
18. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 2 of 7
19. (unstack b6 b17)
   deleted: (on b6 b17) (clear b6) (arm-empty)
   added: (holding b6) (clear b17)
   goals met: 1 of 7
20. (stack b6 b3)
   deleted: (clear b3) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b3)
   goals met: 3 of 7
21. (unstack b50 b51)
   deleted: (on b50 b51) (clear b50) (arm-empty)
   added: (holding b50) (clear b51)
   goals met: 3 of 7
22. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 3 of 7
23. (unstack b51 b56)
   deleted: (on b51 b56) (clear b51) (arm-empty)
   added: (holding b51) (clear b56)
   goals met: 3 of 7
24. (putdown b51)
   deleted: (holding b51)
   added: (clear b51) (arm-empty) (on-table b51)
   goals met: 3 of 7
25. (unstack b56 b59)
   deleted: (on b56 b59) (clear b56) (arm-empty)
   added: (holding b56) (clear b59)
   goals met: 3 of 7
26. (putdown b56)
   deleted: (holding b56)
   added: (clear b56) (arm-empty) (on-table b56)
   goals met: 3 of 7
27. (unstack b59 b54)
   deleted: (on b59 b54) (clear b59) (arm-empty)
   added: (holding b59) (clear b54)
   goals met: 3 of 7
28. (putdown b59)
   deleted: (holding b59)
   added: (clear b59) (arm-empty) (on-table b59)
   goals met: 3 of 7
29. (unstack b54 b4)
   deleted: (on b54 b4) (clear b54) (arm-empty)
   added: (holding b54) (clear b4)
   goals met: 3 of 7
30. (putdown b54)
   deleted: (holding b54)
   added: (clear b54) (arm-empty) (on-table b54)
   goals met: 3 of 7
31. (unstack b4 b24)
   deleted: (on b4 b24) (clear b4) (arm-empty)
   added: (holding b4) (clear b24)
   goals met: 3 of 7
32. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 4 of 7
33. (unstack b24 b20)
   deleted: (on b24 b20) (clear b24) (arm-empty)
   added: (holding b24) (clear b20)
   goals met: 4 of 7
34. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 4 of 7
35. (unstack b20 b49)
   deleted: (on b20 b49) (clear b20) (arm-empty)
   added: (holding b20) (clear b49)
   goals met: 4 of 7
36. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 4 of 7
37. (unstack b49 b46)
   deleted: (on b49 b46) (clear b49) (arm-empty)
   added: (holding b49) (clear b46)
   goals met: 4 of 7
38. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 4 of 7
39. (unstack b46 b28)
   deleted: (on b46 b28) (clear b46) (arm-empty)
   added: (holding b46) (clear b28)
   goals met: 4 of 7
40. (putdown b46)
   deleted: (holding b46)
   added: (clear b46) (arm-empty) (on-table b46)
   goals met: 4 of 7
41. (unstack b28 b38)
   deleted: (on b28 b38) (clear b28) (arm-empty)
   added: (holding b28) (clear b38)
   goals met: 4 of 7
42. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 4 of 7
43. (unstack b38 b43)
   deleted: (on b38 b43) (clear b38) (arm-empty)
   added: (holding b38) (clear b43)
   goals met: 4 of 7
44. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 4 of 7
45. (unstack b43 b31)
   deleted: (on b43 b31) (clear b43) (arm-empty)
   added: (holding b43) (clear b31)
   goals met: 4 of 7
46. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 4 of 7
47. (unstack b31 b22)
   deleted: (on b31 b22) (clear b31) (arm-empty)
   added: (holding b31) (clear b22)
   goals met: 4 of 7
48. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 4 of 7
49. (unstack b22 b2)
   deleted: (on b22 b2) (clear b22) (arm-empty)
   added: (holding b22) (clear b2)
   goals met: 4 of 7
50. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 4 of 7
51. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 4 of 7
52. (stack b2 b4)
   deleted: (clear b4) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b4)
   goals met: 5 of 7
53. (unstack b61 b60)
   deleted: (on b61 b60) (clear b61) (arm-empty)
   added: (holding b61) (clear b60)
   goals met: 5 of 7
54. (putdown b61)
   deleted: (holding b61)
   added: (clear b61) (arm-empty) (on-table b61)
   goals met: 5 of 7
55. (unstack b60 b16)
   deleted: (on b60 b16) (clear b60) (arm-empty)
   added: (holding b60) (clear b16)
   goals met: 5 of 7
56. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 5 of 7
57. (unstack b16 b8)
   deleted: (on b16 b8) (clear b16) (arm-empty)
   added: (holding b16) (clear b8)
   goals met: 5 of 7
58. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 5 of 7
59. (unstack b8 b32)
   deleted: (on b8 b32) (clear b8) (arm-empty)
   added: (holding b8) (clear b32)
   goals met: 5 of 7
60. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 5 of 7
61. (unstack b32 b37)
   deleted: (on b32 b37) (clear b32) (arm-empty)
   added: (holding b32) (clear b37)
   goals met: 5 of 7
62. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 5 of 7
63. (unstack b37 b26)
   deleted: (on b37 b26) (clear b37) (arm-empty)
   added: (holding b37) (clear b26)
   goals met: 5 of 7
64. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 5 of 7
65. (unstack b26 b55)
   deleted: (on b26 b55) (clear b26) (arm-empty)
   added: (holding b26) (clear b55)
   goals met: 5 of 7
66. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 5 of 7
67. (unstack b55 b30)
   deleted: (on b55 b30) (clear b55) (arm-empty)
   added: (holding b55) (clear b30)
   goals met: 5 of 7
68. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 5 of 7
69. (unstack b30 b9)
   deleted: (on b30 b9) (clear b30) (arm-empty)
   added: (holding b30) (clear b9)
   goals met: 5 of 7
70. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 5 of 7
71. (unstack b9 b18)
   deleted: (on b9 b18) (clear b9) (arm-empty)
   added: (holding b9) (clear b18)
   goals met: 5 of 7
72. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 5 of 7
73. (unstack b18 b1)
   deleted: (on b18 b1) (clear b18) (arm-empty)
   added: (holding b18) (clear b1)
   goals met: 5 of 7
74. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 5 of 7
75. (unstack b1 b7)
   deleted: (on b1 b7) (clear b1) (arm-empty)
   added: (holding b1) (clear b7)
   goals met: 5 of 7
76. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 6 of 7
77. (unstack b6 b3)
   deleted: (on b6 b3) (clear b6) (arm-empty)
   added: (holding b6) (clear b3)
   goals met: 4 of 7
78. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 5 of 7
79. (unstack b3 b15)
   deleted: (on b3 b15) (clear b3) (arm-empty)
   added: (holding b3) (clear b15)
   goals met: 5 of 7
80. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 6 of 7
81. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 5 of 7
82. (stack b6 b3)
   deleted: (clear b3) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b3)
   goals met: 7 of 7
